#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fleek-network/ursa-testnet/runs/run-u1f7D5rzh1vZRoTy

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
module.k8s_apps_ams3.digitalocean_domain.k8s_domains["testnet.ursa.earth"]: Refreshing state... [id=testnet.ursa.earth]
digitalocean_tag.ursa_node: Refreshing state... [id=ursa-node-ams3]
digitalocean_tag.ursa_bootstrap_node: Refreshing state... [id=ursa-bootstrap-node-ams3]
digitalocean_project.ursa: Refreshing state... [id=daa74cee-a83d-41fc-a30b-0c066ad388bb]
module.k8s_apps_ams3.digitalocean_record.cname_redirects["testnet.ursa.earth"]: Refreshing state... [id=356873354]
module.k8s_apps_ams3.digitalocean_kubernetes_cluster.ursa_cluster: Refreshing state... [id=f7b0bb0c-0be2-4134-ad52-294c7d6ae359]
module.k8s_apps_ams3.digitalocean_loadbalancer.main: Refreshing state... [id=8d783a2e-3cf9-46d5-a7ee-53faa1711c43]
module.k8s_apps_ams3.digitalocean_kubernetes_node_pool.bootstrap_pool: Refreshing state... [id=2c7d4ddc-5677-4527-b81c-11c6c9c6d327]
module.k8s_apps_ams3.digitalocean_firewall.ursa_peering: Refreshing state... [id=d7d06a9f-875e-4dde-a1c4-8029b17c6d91]
module.k8s_apps_ams3.kubernetes_namespace_v1.ursa: Refreshing state... [id=ursa]
module.k8s_apps_ams3.helm_release.ingress_nginx: Refreshing state... [id=nginx-ingress-controller]
module.k8s_apps_ams3.kubernetes_daemonset.ursa_bootstrap_node: Refreshing state... [id=ursa/ursa-bootstrap-node]
module.k8s_apps_ams3.kubernetes_daemonset.ursa_node: Refreshing state... [id=ursa/ursa-node]
module.k8s_apps_ams3.digitalocean_project_resources.project_resources: Refreshing state... [id=daa74cee-a83d-41fc-a30b-0c066ad388bb]
module.k8s_apps_ams3.kubernetes_service_v1.ursa: Refreshing state... [id=ursa/ursa-service]
module.k8s_apps_ams3.kubernetes_ingress_v1.default_cluster_ingress: Refreshing state... [id=ursa/ursa-ams3-ingress]
module.k8s_apps_ams3.digitalocean_record.a_records["testnet.ursa.earth"]: Refreshing state... [id=356873937]
module.k8s_apps_ams3.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.k8s_apps_ams3.helm_release.cluster-issuer: Refreshing state... [id=cluster-issuer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.fly_ursa_gateway.fly_app.ursa_gateway will be created
  + resource "fly_app" "ursa_gateway" {
      + appurl = (known after apply)
      + id     = (known after apply)
      + name   = "ursa-gateway"
      + org    = "fleek-network"
      + orgid  = (known after apply)
    }

  # module.fly_ursa_gateway.fly_ip.ursa_gateway_ip will be created
  + resource "fly_ip" "ursa_gateway_ip" {
      + address = (known after apply)
      + app     = "ursa-gateway"
      + id      = (known after apply)
      + region  = (known after apply)
      + type    = "v4"
    }

  # module.fly_ursa_gateway.fly_ip.ursa_gateway_ipv6 will be created
  + resource "fly_ip" "ursa_gateway_ipv6" {
      + address = (known after apply)
      + app     = "ursa-gateway"
      + id      = (known after apply)
      + region  = (known after apply)
      + type    = "v6"
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["ams"] will be created
  + resource "fly_machine" "ursa_gateway_machine" {
      + app       = "ursa-gateway"
      + cpus      = 4
      + cputype   = (known after apply)
      + env       = (known after apply)
      + id        = (known after apply)
      + image     = "fleeknetwork/ursa-gateway"
      + memorymb  = 8192
      + name      = "ursa-gateway-ams"
      + privateip = (known after apply)
      + region    = "ams"
      + services  = [
          + {
              + internal_port = 80
              + ports         = [
                  + {
                      + handlers = [
                          + "tls",
                          + "http",
                        ]
                      + port     = 443
                    },
                  + {
                      + handlers = [
                          + "http",
                        ]
                      + port     = 80
                    },
                ]
              + protocol      = "tcp"
            },
        ]
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["ewr"] will be created
  + resource "fly_machine" "ursa_gateway_machine" {
      + app       = "ursa-gateway"
      + cpus      = 4
      + cputype   = (known after apply)
      + env       = (known after apply)
      + id        = (known after apply)
      + image     = "fleeknetwork/ursa-gateway"
      + memorymb  = 8192
      + name      = "ursa-gateway-ewr"
      + privateip = (known after apply)
      + region    = "ewr"
      + services  = [
          + {
              + internal_port = 80
              + ports         = [
                  + {
                      + handlers = [
                          + "tls",
                          + "http",
                        ]
                      + port     = 443
                    },
                  + {
                      + handlers = [
                          + "http",
                        ]
                      + port     = 80
                    },
                ]
              + protocol      = "tcp"
            },
        ]
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["lax"] will be created
  + resource "fly_machine" "ursa_gateway_machine" {
      + app       = "ursa-gateway"
      + cpus      = 4
      + cputype   = (known after apply)
      + env       = (known after apply)
      + id        = (known after apply)
      + image     = "fleeknetwork/ursa-gateway"
      + memorymb  = 8192
      + name      = "ursa-gateway-lax"
      + privateip = (known after apply)
      + region    = "lax"
      + services  = [
          + {
              + internal_port = 80
              + ports         = [
                  + {
                      + handlers = [
                          + "tls",
                          + "http",
                        ]
                      + port     = 443
                    },
                  + {
                      + handlers = [
                          + "http",
                        ]
                      + port     = 80
                    },
                ]
              + protocol      = "tcp"
            },
        ]
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["lhr"] will be created
  + resource "fly_machine" "ursa_gateway_machine" {
      + app       = "ursa-gateway"
      + cpus      = 4
      + cputype   = (known after apply)
      + env       = (known after apply)
      + id        = (known after apply)
      + image     = "fleeknetwork/ursa-gateway"
      + memorymb  = 8192
      + name      = "ursa-gateway-lhr"
      + privateip = (known after apply)
      + region    = "lhr"
      + services  = [
          + {
              + internal_port = 80
              + ports         = [
                  + {
                      + handlers = [
                          + "tls",
                          + "http",
                        ]
                      + port     = 443
                    },
                  + {
                      + handlers = [
                          + "http",
                        ]
                      + port     = 80
                    },
                ]
              + protocol      = "tcp"
            },
        ]
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["yul"] will be created
  + resource "fly_machine" "ursa_gateway_machine" {
      + app       = "ursa-gateway"
      + cpus      = 4
      + cputype   = (known after apply)
      + env       = (known after apply)
      + id        = (known after apply)
      + image     = "fleeknetwork/ursa-gateway"
      + memorymb  = 8192
      + name      = "ursa-gateway-yul"
      + privateip = (known after apply)
      + region    = "yul"
      + services  = [
          + {
              + internal_port = 80
              + ports         = [
                  + {
                      + handlers = [
                          + "tls",
                          + "http",
                        ]
                      + port     = 443
                    },
                  + {
                      + handlers = [
                          + "http",
                        ]
                      + port     = 80
                    },
                ]
              + protocol      = "tcp"
            },
        ]
    }

  # module.fly_ursa_gateway.fly_machine.ursa_gateway_machine["yyz"] will be created
  + resource "fly_machine" "ursa_gateway_machine" {
      + app       = "ursa-gateway"
      + cpus      = 4
      + cputype   = (known after apply)
      + env       = (known after apply)
      + id        = (known after apply)
      + image     = "fleeknetwork/ursa-gateway"
      + memorymb  = 8192
      + name      = "ursa-gateway-yyz"
      + privateip = (known after apply)
      + region    = "yyz"
      + services  = [
          + {
              + internal_port = 80
              + ports         = [
                  + {
                      + handlers = [
                          + "tls",
                          + "http",
                        ]
                      + port     = 443
                    },
                  + {
                      + handlers = [
                          + "http",
                        ]
                      + port     = 80
                    },
                ]
              + protocol      = "tcp"
            },
        ]
    }

  # module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["ams"] will be created
  + resource "fly_volume" "ursa_gateway_volume" {
      + app        = "ursa-gateway"
      + id         = (known after apply)
      + internalid = (known after apply)
      + name       = "ursa_data_ams"
      + region     = "ams"
      + size       = 15
    }

  # module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["ewr"] will be created
  + resource "fly_volume" "ursa_gateway_volume" {
      + app        = "ursa-gateway"
      + id         = (known after apply)
      + internalid = (known after apply)
      + name       = "ursa_data_ewr"
      + region     = "ewr"
      + size       = 15
    }

  # module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["lax"] will be created
  + resource "fly_volume" "ursa_gateway_volume" {
      + app        = "ursa-gateway"
      + id         = (known after apply)
      + internalid = (known after apply)
      + name       = "ursa_data_lax"
      + region     = "lax"
      + size       = 15
    }

  # module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["lhr"] will be created
  + resource "fly_volume" "ursa_gateway_volume" {
      + app        = "ursa-gateway"
      + id         = (known after apply)
      + internalid = (known after apply)
      + name       = "ursa_data_lhr"
      + region     = "lhr"
      + size       = 15
    }

  # module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["yul"] will be created
  + resource "fly_volume" "ursa_gateway_volume" {
      + app        = "ursa-gateway"
      + id         = (known after apply)
      + internalid = (known after apply)
      + name       = "ursa_data_yul"
      + region     = "yul"
      + size       = 15
    }

  # module.fly_ursa_gateway.fly_volume.ursa_gateway_volume["yyz"] will be created
  + resource "fly_volume" "ursa_gateway_volume" {
      + app        = "ursa-gateway"
      + id         = (known after apply)
      + internalid = (known after apply)
      + name       = "ursa_data_yyz"
      + region     = "yyz"
      + size       = 15
    }

  # module.k8s_apps_ams3.kubernetes_ingress_v1.default_cluster_ingress will be updated in-place
  ~ resource "kubernetes_ingress_v1" "default_cluster_ingress" {
        id     = "ursa/ursa-ams3-ingress"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              ~ "cert-manager.io/cluster-issuer"       = "letsencrypt-prod" -> "letsencrypt-staging"
                # (3 unchanged elements hidden)
            }
            name             = "ursa-ams3-ingress"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 15 to add, 1 to change, 0 to destroy.


```
</details>
*Pushed by: @b0xtch, Action: `pull_request`*